import directions_1 from "@/public/directions_1.jpg";
import directions_2 from "@/public/directions_2.jpg";
import directions_3 from "@/public/directions_3.jpg";
import directions_4 from "@/public/directions_4.jpg";
import directions_5 from "@/public/directions_5.jpg";

export const directions_lib = [
  {
    slide: {
      src: directions_1,
      width: 200,
      height: 200,
      alt: "arms in the round",
    },
    text: {
      title: "Комплексне заняття",
      W: 250,
      desc: [
        "Компексне заняття містить в собі асани на розтяжку, різні типи дихання, які полупшують роботу серця і легенів і підвищують загальну витрівалість організму, а також силові асани, які роблять міцніше м’язи. Наприкінці заняття викуонуються вправи на розслаблення і медитація в глибокій йога-нідра",
      ],
    },
  },
  {
    slide: {
      src: directions_2,
      width: 200,
      height: 200,
      alt: "a man on the fitball",
    },
    text: {
      title: "Йогатерапія",
      W: 150,
      desc: [
        "Йогатерапія по більшості орієнтована на індівідуальні заняття, тому що головне завдання - вирішити певні проблеми з фізичним або нервово-псіхологічним станом людини, яка вирішує почати займатися в нас.",

        "Йогатерапевтичний комплекс з елементами фізіотерапії та лікувальної гімнастики, зосереджується на використанні методів та технік йоги, як інструментів для відновлення організму на всіх рівнях.",

        "Вибір технік підбирається на розумінні анамнезу захворювань від нервових проблем до порушень опорнорухового апарату.",
      ],
    },
  },
  {
    slide: {
      src: directions_3,
      width: 200,
      height: 200,
      alt: "a man doing meditation",
    },
    text: {
      title: "Медитації та пранаями",
      W: 260,
      desc: [
        "Медитації цілюще впливають як на фізичний, так і на душевний стан людини, додають та гармонізують життеву енергую організму. Практикуючи медитацію, ви навчитеся керувати своїми емоціями, будете краще справлятися зі стресом і депресією, зназать тривогу та зробить більш доброзичливими до оточуючих.",

        "Пранаяма - це дихальна практика в йозі, сукупність дихальних вправ, виконуючи які практикуючий вчиться свідомо управляти власним диханням. Практика техник пранаями очищує енергетичні канали, надає легкість, усвідомлення дихання та контроль над життєвою енергією. Окремі техніки дихання використоруються як підготовчі елементи до медітацій",
      ],
    },
  },
  {
    slide: {
      src: directions_4,
      width: 200,
      height: 200,
      alt: "a woman in extreme position",
    },
    text: {
      title: "Майстер-клас зі шпагатів",
      W: 350,
      desc: [
        "Гнучкість нашого мислення досить часто залежить від гнучкості тіла. Шпагати для цієї цілі підходять якнайкраще.",

        "Як і в іншіх складних асанах, у шпагатів яскраво виражений псіхологічний ефект. Шпагати активно задіюють передню та задню частини стегон, м’язи тазового дна, які активно починають діяти та укріплюватись.",

        "Особливу користь надають шпагати репродуктивному здоров’ю чоловіков та жінок. У сучасному світі на ньго негативно впливають малорухливий спосіб життя, пагана екологія, не дуже корисне   живлення, різні інфекції.",

        "Ми надаємо ефективні техніки досягнення подовжних та поперекових шпагатів продовж відносно невеликого часу",
      ],
    },
  },
  {
    slide: {
      src: directions_5,
      width: 200,
      height: 200,
      alt: "two woman doing yoga on a hill near the sea",
    },
    text: {
      title: "Йогатури",
      W: 120,
      desc: [
        "Йога-тур, як варіант для активного відпочинку зі змістом. Користь хорошого йога-туру величезна: спортивний і водночас розслаблюючий, насичений подіями та тренуваннями, він допомагає прибрати втому та зняти стрес, зарядитися енергією, налаштуватися на позитив, освоїти нові практики. Це міні-подорож, реальна та ментальна, яка стане ключем до фізичної та духовної рівноваги.",

        "Йога-тури — це завжди багато йоги, включаючи асани, пранаями, медитацію під керівництвом професійного інструктора та спілкування у колі однодумців. ",
      ],
    },
  },
];
